
public class Operators {
    public static void main(String[] args) {
        // -------------------------------------------
        // операторы
        int i2 = -100;
        int i3 = 500 - 100;

        int i4 = 100 * 2;
        int i5 = 100 / 150;

        float f3 = 100f / 150;

        int i6 = 10;
        i6 += 10; // i6 = i6 + 10;
        i6 -= 10;
        i6 *= 10;
        i6 /= 10;

        // инкремент (++)
        int i7 = 100;
        // i7++; // i7 = i7 + 1; // i7 += 1; // постфиксный инкремент
        int i8 = ++i7;                      // префиксный инкремент

        // ----------------

        int q = 100;
        int f = ++q; // q = 101; f = 101;

        // декремент (--)
        int w = 100;
        int r = --w;
    }
}
